transformation-library/src/test/resources/patientprofile/dsq.response/unsval_date_creation_time_must_be_smaller.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">287fe481-b809-435e-813e-b3e3f188a4c8</cais:TrackingId>
        <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">18c7022a48-4c78-a429-1285d-12ca0ea9f
        </cais:TransactionId>
        <cais:SessionID xmlns:cais="http://cais-icp.org/v1">59e30c740d424dcdaba165c2bd081</cais:SessionID>
    </s:Header>
    <s:Body>
        <PRPA_IN101104CA ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3"
                         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <id root="19bda72f-52fe-4103-9b15-fed474a22499"/>
            <creationTime value="20210909171310"/>
            <responseModeCode code="I"/>
            <versionCode code="NE2006"/>
            <interactionId root="2.16.124.10.101.1.60.5.2.111" extension="PRPA_IN101104CA" displayable="true"/>
            <processingCode code="D"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.40.5.2" extension="TMPT-RI" use="BUS"/>
                    <agent xsi:nil="true"/>
                </device>
            </receiver>
            <respondTo xsi:nil="true"/>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                    <name>Registre des usagers</name>
                    <agent xsi:nil="true"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AE"/>
                <targetMessage>
                    <id root="2.16.840.1.113883.3.40.1.5"/>
                </targetMessage>
                <acknowledgementDetail typeCode="E">
                    <code code="UNSVAL"/>
                    <text>Unsupported value</text>
                    <location>PRPA_IN101103CA/creationTime[@value]</location>
                </acknowledgementDetail>
            </acknowledgement>
            <controlActEvent moodCode="EVN">
                <id root="2.16.840.1.113883.3.40.4.1" extension="564654" use="BUS"/>
                <code code="PRPA_TE101104CA" codeSystem="2.16.840.1.113883.11.19427"/>
                <statusCode code="completed"/>
                <queryAck>
                    <queryId root="2.16.840.1.113883.3.40.1.5"/>
                    <queryResponseCode code="AE"/>
                    <resultTotalQuantity value="0"/>
                    <resultCurrentQuantity value="0"/>
                    <resultRemainingQuantity value="0"/>
                </queryAck>
                <queryByParameter>
                    <queryId root="BB7321A1-3365-44BA-8F7C-AF54EF0F0146"/>
                    <parameterList>
                        <administrativeGender>
                            <value code="F"/>
                        </administrativeGender>
                        <clientId>
                            <value root="2.16.124.10.101.1.60.100" extension="MICF93560415"/>
                        </clientId>
                        <deceasedIndicator xsi:nil="true"/>
                        <deceasedTime xsi:nil="true"/>
                        <languageCode xsi:nil="true"/>
                        <multipleBirthIndicator xsi:nil="true"/>
                        <multipleBirthOrderNumber xsi:nil="true"/>
                        <personBirthtime>
                            <value value="19930604"/>
                        </personBirthtime>
                        <personName>
                            <value>
                                <given partType="GIV">Michel</given>
                                <family partType="FAM">Flore</family>
                            </value>
                        </personName>
                        <personalRelationshipCode xsi:nil="true"/>
                    </parameterList>
                </queryByParameter>
            </controlActEvent>
        </PRPA_IN101104CA>
    </s:Body>
</s:Envelope>