transformation-library/src/test/resources/patientprofile/dsq.response/find_candidate_patient_found_response.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">e59b672e-ea03-468a-9d5d-1a2a93d68575</cais:TrackingId>
        <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">67deeeab-2404-4a85-ae31-8517b79856fc
        </cais:TransactionId>
        <cais:SessionID xmlns:cais="http://cais-icp.org/v1">ac490167a68a43ec819217dff65c8</cais:SessionID>
    </s:Header>
    <s:Body>
        <PRPA_IN101104CA xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0"
                         xmlns="urn:hl7-org:v3">
            <id root="738ebb97-1956-4ee6-af81-dbedd730badb"/>
            <creationTime value="20210913220528"/>
            <responseModeCode code="I"/>
            <versionCode code="NE2006"/>
            <interactionId root="2.16.124.10.101.1.60.5.2.111" extension="PRPA_IN101104CA" displayable="true"/>
            <processingCode code="D"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.40.5.2" extension="TMPT-RI" use="BUS"/>
                    <agent xsi:nil="true"/>
                </device>
            </receiver>
            <respondTo xsi:nil="true"/>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                    <name>Registre des usagers</name>
                    <agent xsi:nil="true"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                    <id root="2.16.840.1.113883.3.40.1.5"/>
                </targetMessage>
            </acknowledgement>
            <controlActEvent moodCode="EVN">
                <id root="2.16.840.1.113883.3.40.4.1" extension="564654" use="BUS"/>
                <code code="PRPA_TE101104CA" codeSystem="2.16.840.1.113883.11.19427"/>
                <statusCode code="completed"/>
                <subject typeCode="SUBJ" contextControlCode="ON">
                    <registrationEvent classCode="REG" moodCode="EVN">
                        <statusCode code="active"/>
                        <subject contextControlCode="AN">
                            <identifiedEntity classCode="IDENT">
                                <id root="2.16.840.1.113883.4.56" extension="8000000318" displayable="false"/>
                                <id root="2.16.124.10.101.1.60.100" extension="MAYM21561219" displayable="true"/>
                                <statusCode code="active"/>
                                <effectiveTime>
                                    <low value="20210913"/>
                                    <high nullFlavor="NI"/>
                                </effectiveTime>
                                <confidentialityCode code="NI"/>
                                <identifiedPerson classCode="PSN" determinerCode="INSTANCE">
                                    <name>
                                        <given partType="GIV">Marina</given>
                                        <family partType="FAM">Mayer</family>
                                    </name>
                                    <telecom nullFlavor="MSK"/>
                                    <administrativeGenderCode code="F"/>
                                    <birthTime value="20210612"/>
                                    <deceasedInd value="false"/>
                                    <deceasedTime nullFlavor="UNK"/>
                                    <multipleBirthInd nullFlavor="UNK"/>
                                    <addr>
                                        <streetAddressLine partType="SAL">4109 avenue Isabella</streetAddressLine>
                                        <city partType="CTY">Montral</city>
                                        <state partType="STA">Qc</state>
                                        <country partType="CNT">CA</country>
                                        <postalCode partType="ZIP">H3T1N5</postalCode>
                                    </addr>
                                    <personalRelationship classCode="PRS">
                                        <code code="MTH"/>
                                        <relationshipHolder classCode="PSN" determinerCode="INSTANCE">
                                            <id nullFlavor="UNK"/>
                                            <name>
                                                <given partType="GIV">Flore</given>
                                                <family partType="FAM">Michel</family>
                                            </name>
                                        </relationshipHolder>
                                    </personalRelationship>
                                    <personalRelationship classCode="PRS">
                                        <code code="FTH"/>
                                        <relationshipHolder classCode="PSN" determinerCode="INSTANCE">
                                            <id nullFlavor="UNK"/>
                                            <name>
                                                <given partType="GIV">Fares</given>
                                                <family partType="FAM">Mayer</family>
                                            </name>
                                        </relationshipHolder>
                                    </personalRelationship>
                                    <languageCommunication>
                                        <languageCode nullFlavor="MSK"/>
                                    </languageCommunication>
                                </identifiedPerson>
                                <subjectOf typeCode="SBJ">
                                    <observationEvent classCode="OBS" moodCode="EVN">
                                        <code code="ProbabilityMatchObservation"/>
                                        <value value="0.5990"/>
                                    </observationEvent>
                                </subjectOf>
                            </identifiedEntity>
                        </subject>
                        <custodian typeCode="CST" contextControlCode="AP">
                            <assignedDevice classCode="ASSIGNED">
                                <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                                    <name>Registre des usagers</name>
                                </assignedRepository>
                                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                                    <name>Québec</name>
                                </representedRepositoryJurisdiction>
                            </assignedDevice>
                        </custodian>
                    </registrationEvent>
                </subject>
                <queryAck>
                    <queryId root="2.16.840.1.113883.3.40.1.5"/>
                    <queryResponseCode code="OK"/>
                    <resultTotalQuantity value="1"/>
                    <resultCurrentQuantity value="1"/>
                    <resultRemainingQuantity value="0"/>
                </queryAck>
                <queryByParameter>
                    <queryId root="BB7321A1-3365-44BA-8F7C-AF54EF0F0146"/>
                    <parameterList>
                        <administrativeGender xsi:nil="true"/>
                        <clientId>
                            <value root="2.16.124.10.101.1.60.100" extension="MAYM21561219"/>
                        </clientId>
                        <deceasedIndicator xsi:nil="true"/>
                        <deceasedTime xsi:nil="true"/>
                        <languageCode xsi:nil="true"/>
                        <multipleBirthIndicator xsi:nil="true"/>
                        <multipleBirthOrderNumber xsi:nil="true"/>
                        <personBirthtime xsi:nil="true"/>
                        <personalRelationshipCode xsi:nil="true"/>
                    </parameterList>
                </queryByParameter>
            </controlActEvent>
        </PRPA_IN101104CA>
    </s:Body>
</s:Envelope>